Tekla Open API Reference for Tekla Structures 2025
ChangeData.ChangeSourceTypeEnum Enumeration
 The source types of changed event.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ChangeSourceTypeEnum
Public Enumeration ChangeSourceTypeEnum
Members
Member name | Value | Description
COMMIT | 0 |  Normal commit
UNDO_REDO | 1 |  Undo or redo pressed
ROLLBACK | 2 |  Rollback of database
See Also
Reference
Tekla.Structures.Model Namespace